sdaiGetSchema(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves a schema with a specified name.
\param schemaName [in] A string that contains the schema name.
\returns The schema with the specified name.
\code
SdaiSchema ifc2x3schema = sdaiGetSchema("IFC2X3");
\remarks
The function is case insensitive.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiSY_ERR - Underlying system error.